/* ========================================
	DX22Base/
	------------------------------------
	図形表示用cpp(各種図形の作成処理)
	------------------------------------
	_geometory.cpp
========================================== */

// =============== インクルード ===================
#include "Geometory.h"

/* ========================================
	立方体作成関数
	-------------------------------------
	内容：立方体を作成する
=========================================== */
void Geometory::MakeBox()
{

	// 元データの作成
	Vertex vtx[] = {

	// 手前、奥 ----------------------------------
		// -Z面
		{{-0.5f, 0.5f,-0.5f},{0.0f,0.0f}},	// 0
		{{ 0.5f, 0.5f,-0.5f},{1.0f,0.0f}},	// 1
		{{-0.5f,-0.5f,-0.5f},{0.0f,1.0f}},	// 2	
		{{ 0.5f,-0.5f,-0.5f},{1.0f,1.0f}},	// 3

		// +Z面
		{{  0.5f, 0.5f,0.5f},{0.0f,0.0f}},
		{{ -0.5f, 0.5f,0.5f},{1.0f,0.0f}},
		{{  0.5f,-0.5f,0.5f},{0.0f,1.0f}},
		{{ -0.5f,-0.5f,0.5f},{1.0f,1.0f}},

	// 左右 ----------------------------------
		// -X面
		{{-0.5f, 0.5f, 0.5f},{0.0f,0.0f}},
		{{-0.5f, 0.5f,-0.5f},{1.0f,0.0f}},
		{{-0.5f,-0.5f,0.5f},{0.0f,1.0f}},
		{{-0.5f,-0.5f,-0.5f},{1.0f,1.0f}},

		// +X面
		{{0.5f, 0.5f,-0.5f},{0.0f,0.0f}},	
		{{0.5f, 0.5f, 0.5f},{1.0f,0.0f}},	
		{{0.5f,-0.5f,-0.5f},{0.0f,1.0f}},		
		{{0.5f,-0.5f, 0.5f},{1.0f,1.0f}},	

	// 上下 ----------------------------------
		// -Y面
		{{-0.5f,-0.5f,-0.5f},{0.0f,0.0f}},	
		{{ 0.5f,-0.5f,-0.5f},{1.0f,0.0f}},	
		{{-0.5f,-0.5f, 0.5f},{0.0f,1.0f}},		
		{{ 0.5f,-0.5f, 0.5f},{1.0f,1.0f}},	

		// +Y面
		{{-0.5f,0.5f, 0.5f},{0.0f,0.0f}},
		{{ 0.5f,0.5f, 0.5f},{1.0f,0.0f}},
		{{-0.5f,0.5f,-0.5f},{0.0f,1.0f}},
		{{ 0.5f,0.5f,-0.5f},{1.0f,1.0f}},
	};
	int idx[] = {
		0,1,2,1,3,2,		
		4,5,6,5,7,6,		
		8,9,10,9,11,10,		
		12,13,14,13,15,14,	
		16,17,18,17,19,18,	
		20,21,22,21,23,22,	

	};

	// バッファの作成
	MeshBuffer::T_MeshData desc = {};
	desc.pVtx		= vtx;
	desc.vtxCount	= _countof(vtx);		// 頂点の数(_countofは配列の数を数える)
	desc.vtxSize	= sizeof(Vertex);		// 頂点一つあたりのデータサイズ
	desc.pIdx		= idx;					 
	desc.idxCount	= _countof(idx);		// インデックスの数
	desc.idxSize	= sizeof(int);			// インデックス一つあたりのデータサイズ
	desc.topology	= D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST;
	//desc.topology = D3D11_PRIMITIVE_TOPOLOGY_LINELIST;
	m_pBox			= new MeshBuffer(desc);
}

/* ========================================
	円柱作成関数
	-------------------------------------
	内容：円柱を作成する
=========================================== */
void Geometory::MakeCylinder()
{
	//--- 頂点の作成
	// 天面、底面
	for (int i = 0; i < 8; i++)
	{

	}

	// 側面

	//--- インデックスの作成
	// 天面、底面


	// 側面


	//--- バッファの作成
}

/* ========================================
	球作成関数
	-------------------------------------
	内容：球を作成する
=========================================== */
void Geometory::MakeSphere()
{
	//--- 頂点の作成

	//--- インデックスの作成

	// バッファの作成
}