/* ========================================
	DX22Base/
	------------------------------------
	ライトオブジェクト(ポイントライト)用cpp
	------------------------------------
	ObjectLightPoint.cpp
========================================== */

// =============== インクルード ===================
#include "ObjectLightPoint.h"

// =============== 定数定義 =======================
const float DEFAULT_RANGE = 3.0f;	// デフォルトの範囲

/* ========================================
	コンストラクタ関数
	-------------------------------------
	内容：初期化
	-------------------------------------
	引数1：所有者オブジェクト
========================================== */
ObjectLightPoint::ObjectLightPoint(SceneBase* pScene)
	: ObjectLight(pScene)
{
}

/* ========================================
	初期化関数
	-------------------------------------
	内容：オブジェクトの初期化
========================================== */
void ObjectLightPoint::InitLocal()
{
	// 親クラスの初期化関数を呼ぶ
	ObjectLight::InitLocal();

	// ライト種類を設定
	m_pCompLightBase->SetLightType(ComponentLightBase::E_LightType::POINT);

	// デフォルトの範囲を設定
	m_pCompLightBase->SetRange(DEFAULT_RANGE);

}
