/* ========================================
	DX22Base/
	------------------------------------
	シーン管理用cpp
	------------------------------------
	SceneManager.cpp
========================================== */

// =============== インクルード =====================
#include "SceneManager.h"
#include "SceneBase.h"

/* ========================================
	コンストラクタ関数
	-------------------------------------
	内容：初期化
=========================================== */
void SceneManager::Init()
{
	//ChangeScene<SceneStageSave_1>();
}

/* ========================================
	デストラクタ関数
	-------------------------------------
	内容：削除時
=========================================== */
void SceneManager::Uninit()
{
	m_pScene->Uninit();	// 終了処理
}


/* ========================================
	更新関数
	-------------------------------------
	内容：更新処理
=========================================== */
void SceneManager::Update()
{
	m_pScene->Update();	// 更新処理
}

/* ========================================
	描画関数
	-------------------------------------
	内容：描画処理
=========================================== */
void SceneManager::Draw()
{
	m_pScene->Draw();	// 描画処理
}

/* ========================================
	シーン再読み込み処理呼び出し関数
	-------------------------------------
	内容：オブジェクトループ内で再読み込み処理を行うと
		　エラーが発生するため、フラグを立てておいて
		　シーンの各処理が終わった後に再読み込み処理を行う
=========================================== */
void SceneManager::CallReloadScene()
{
	m_IsReloadScene = true;
}

/* ========================================
	シーン再読み込み関数
	-------------------------------------
	内容：シーンを再読み込みする
=========================================== */
void SceneManager::ReloadScene()
{
	m_pScene->Uninit();	// 終了処理
	m_pScene->Init();	// 初期化処理

	m_IsReloadScene = false;	// フラグを戻す
}

/* ========================================
	シーン取得関数
	-------------------------------------
	内容：シーンを取得する
	-------------------------------------
	戻り値：SceneBase*		シーン
=========================================== */
SceneBase* SceneManager::GetScene()
{
	return m_pScene.get();
}

/* ========================================
	シーン再読み込みフラグ取得関数
	-------------------------------------
	内容：シーン再読み込みフラグを取得する
	-------------------------------------
	戻り値：bool		シーン再読み込みフラグ
=========================================== */
bool SceneManager::GetIsReloadScene()
{
	return m_IsReloadScene;
}
