/* ========================================
	DX22Base/
	------------------------------------
	ゲーム内時間管理用cpp
	------------------------------------
	TimeManager.cpp
========================================== */

// =============== インクルード =====================
#include "TimeManager.h"
#include "DebugMenu.h"

/* ========================================
	初期化関数
	-------------------------------------
	内容：各変数の初期化
=========================================== */
void TimeManager::Init()
{
	m_fDeltaTime = 0.0f;
	m_fTotalTime = 0.0f;
}

/* ========================================
	更新関数
	-------------------------------------
	内容：前フレームからの経過時間を更新する
	-------------------------------------
	引数1：前フレームからの経過時間
=========================================== */
void TimeManager::Update(float tick)
{
	m_fDeltaTime = tick;	// 前フレームからの経過時間を更新
	m_fTotalTime += tick;	// ゲーム開始からの経過時間を更新
#ifdef _DEBUG

#endif // _DEBUG

}

/* ========================================
	ゲッター(前フレーム経過時間)関数
	-------------------------------------
	戻値：前フレームからの経過時間
=========================================== */
float TimeManager::GetDeltaTime()
{
	return m_fDeltaTime;
}

/* ========================================
	ゲッター(ゲーム開始経過時間)関数
	-------------------------------------
	戻値：ゲーム開始からの経過時間
=========================================== */
float TimeManager::GetTotalTime()
{
	return m_fTotalTime;
}

